// src/lib/keyboardUtils.js

const thaiToEngMap = {
  'ๅ': '1', '/': '2', '-': '3', 'ภ': '4', 'ถ': '5', 'ุ': '6', 'ึ': '7', 'ค': '8', 'ต': '9', 'จ': '0',
  'ข': '-', 'ช': '=',
  'ๆ': 'q', 'ไ': 'w', 'ำ': 'e', 'พ': 'r', 'ะ': 't', 'ั': 'y', 'ี': 'u', 'ร': 'i', 'น': 'o', 'ย': 'p',
  'บ': '[', 'ล': ']',
  'ฟ': 'a', 'ห': 's', 'ก': 'd', 'ด': 'f', 'เ': 'g', '้': 'h', '่': 'j', 'า': 'k', 'ส': 'l', 'ว': ';',
  'ง': "'",
  'ผ': 'z', 'ป': 'x', 'แ': 'c', 'อ': 'v', 'ิ': 'b', 'ท': 'n', 'ม': 'm', 'ใ': ',', 'ฝ': '.',
  'ฐ': '/', 'ฯ': 'Z', 'ญ': 'X', 'ฐ': 'C', 'ฅ': 'V', 'ฑ': 'B', 'ธ': 'N', 'ํ': 'M', 'ณ': '<', 'ฯ': '>',
  'ญ': '?',
  ' ': ' '
};

export const translateThaiToEnglish = (text) => {
  return text.split('').map(char => thaiToEngMap[char] || char).join('');
};